name: "VGG_CNN_M"
layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "label"
  python_param {
    module: "layers.att_data"
    layer: "AttributeData"
    param_str: "{num_classes: 2, stage: TRAIN, class_list: [0, 1]}" 
  }
  include: { phase: TRAIN }
}
layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "label"
  python_param {
    module: "layers.att_data"
    layer: "AttributeData"
    param_str: "{num_classes: 2, stage: VAL, class_list: [0, 1]}" 
  }
  include: { phase: TEST }
}
layer {
  bottom: "data"
  top: "basis1"
  name: "basis1"
  type: "Convolution"
  param {
    name: "basis1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "basis1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 15  # number of basis
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }       
  }
}
layer {
  bottom: "basis1"
  top: "conv1-1"
  name: "conv1-1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
  }
}
layer {
  bottom: "basis1"
  top: "conv1-2"
  name: "conv1-2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
  }
}
layer {
  bottom: "conv1-1"
  top: "conv1-1"
  name: "relu1-1"
  type: "ReLU"
}
layer {
  bottom: "conv1-2"
  top: "conv1-2"
  name: "relu1-2"
  type: "ReLU"
}
layer {
  bottom: "conv1-1"
  top: "norm1-1"
  name: "norm1-1"
  type: "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  bottom: "conv1-2"
  top: "norm1-2"
  name: "norm1-2"
  type: "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  bottom: "norm1-1"
  top: "pool1-1"
  name: "pool1-1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "norm1-2"
  top: "pool1-2"
  name: "pool1-2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "pool1-1"
  top: "basis2-1"
  name: "basis2-1"
  type: "Convolution"
  param {
    name: "basis2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "basis2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 15  # number of basis
    pad: 1
    kernel_size: 5
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }    
  }
}
layer {
  bottom: "pool1-2"
  top: "basis2-2"
  name: "basis2-2"
  type: "Convolution"
  param {
    name: "basis2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "basis2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 15  # number of basis
    pad: 1
    kernel_size: 5
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }    
  }
}
layer {
  bottom: "basis2-1"
  top: "conv2-1"
  name: "conv2-1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
  }
}
layer {
  bottom: "basis2-2"
  top: "conv2-2"
  name: "conv2-2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
  }
}
layer {
  bottom: "conv2-1"
  top: "conv2-1"
  name: "relu2-1"
  type: "ReLU"
}
layer {
  bottom: "conv2-2"
  top: "conv2-2"
  name: "relu2-2"
  type: "ReLU"
}
layer {
  bottom: "conv2-1"
  top: "norm2-1"
  name: "norm2-1"
  type: "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  bottom: "conv2-2"
  top: "norm2-2"
  name: "norm2-2"
  type: "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  bottom: "norm2-1"
  top: "pool2-1"
  name: "pool2-1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "norm2-2"
  top: "pool2-2"
  name: "pool2-2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "pool2-1"
  top: "basis3-1"
  name: "basis3-1"
  type: "Convolution"
  param {
    name: "basis3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "basis3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 15  # number of basis
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}
layer {
  bottom: "pool2-2"
  top: "basis3-2"
  name: "basis3-2"
  type: "Convolution"
  param {
    name: "basis3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "basis3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 15  # number of basis
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }   
  }
}
layer {
  bottom: "basis3-1"
  top: "conv3-1"
  name: "conv3-1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
  }
}
layer {
  bottom: "basis3-2"
  top: "conv3-2"
  name: "conv3-2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
  }
}
layer {
  bottom: "conv3-1"
  top: "conv3-1"
  name: "relu3-1"
  type: "ReLU"
}
layer {
  bottom: "conv3-2"
  top: "conv3-2"
  name: "relu3-2"
  type: "ReLU"
}
layer {
  bottom: "conv3-1"
  top: "basis4-1"
  name: "basis4-1"
  type: "Convolution"
  param {
    name: "basis4_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "basis4_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 15  # number of basis
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }       
  }
}
layer {
  bottom: "conv3-2"
  top: "basis4-2"
  name: "basis4-2"
  type: "Convolution"
  param {
    name: "basis4_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "basis4_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 15  # number of basis
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }    
  }
}
layer {
  bottom: "basis4-1"
  top: "conv4-1"
  name: "conv4-1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
  }
}
layer {
  bottom: "basis4-2"
  top: "conv4-2"
  name: "conv4-2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
  }
}
layer {
  bottom: "conv4-1"
  top: "conv4-1"
  name: "relu4-1"
  type: "ReLU"
}
layer {
  bottom: "conv4-2"
  top: "conv4-2"
  name: "relu4-2"
  type: "ReLU"
}
layer {
  bottom: "conv4-1"
  top: "basis5-1"
  name: "basis5-1"
  type: "Convolution"
  param {
    name: "basis5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "basis5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 15  # number of basis
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }       
  }
}
layer {
  bottom: "conv4-2"
  top: "basis5-2"
  name: "basis5-2"
  type: "Convolution"
  param {
    name: "basis5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "basis5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 15  # number of basis
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }   
  }
}
layer {
  bottom: "basis5-1"
  top: "conv5-1"
  name: "conv5-1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
  }
}
layer {
  bottom: "basis5-2"
  top: "conv5-2"
  name: "conv5-2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
  }
}
layer {
  bottom: "conv5-1"
  top: "conv5-1"
  name: "relu5-1"
  type: "ReLU"
}
layer {
  bottom: "conv5-2"
  top: "conv5-2"
  name: "relu5-2"
  type: "ReLU"
}
layer {
  bottom: "conv5-1"
  top: "pool5-1"
  name: "pool5-1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "conv5-2"
  top: "pool5-2"
  name: "pool5-2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "pool5-1"
  top: "score-1"
  name: "score-1"
 param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  type: "InnerProduct"
  inner_product_param {
    num_output: 1
  weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  bottom: "pool5-2"
  top: "score-2"
  name: "score-2"
 param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  type: "InnerProduct"
  inner_product_param {
    num_output: 1
  weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  bottom: "score-1"
  bottom: "score-2"
  top: "score"  
  name: "concat_score"
  type: "Concat"
  concat_param {
    axis: 1
  }
}
layer {
  bottom: "score"
  bottom: "label"
  name: "loss"
  type: "SigmoidCrossEntropyLoss"
  loss_weight: 1
  include: { phase: TRAIN }
}

layer {
  name: "attr_prob"
  type: "Sigmoid"
  bottom: "score"
  top: "attr_prob"
}
layer {
  name: "error"
  type: "Python"
  bottom: "attr_prob"
  bottom: "label"
  top: "error"
  python_param {
    module: "layers.multilabel_err"
    layer: "MultiLabelErr"
  }
}