name: "branch_5-layer-second"
layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  python_param {
    module: "layers.multilabel_data"
    layer: "MultiLabelData"
    param_str: "class_list: [0, 1, 2, 3]\nnum_classes: 4\nstage: VAL\n"
  }
}
layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  python_param {
    module: "layers.multilabel_data"
    layer: "MultiLabelData"
    param_str: "class_list: [0, 1, 2, 3]\nnum_classes: 4\nstage: TRAIN\n"
  }
}
layer {
  name: "conv1_1_1"
  type: "Convolution"
  bottom: "data"
  top: "conv1_1_1"
  param {
    name: "conv1_1_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    bias_term: true
    pad: 0
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_1_1"
  type: "ReLU"
  bottom: "conv1_1_1"
  top: "conv1_1_1"
}
layer {
  name: "norm1_1_1"
  type: "LRN"
  bottom: "conv1_1_1"
  top: "conv1_1_1"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  name: "pool1_1_1"
  type: "Pooling"
  bottom: "conv1_1_1"
  top: "pool1_1_1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "conv2_1_1"
  type: "Convolution"
  bottom: "pool1_1_1"
  top: "conv2_1_1"
  param {
    name: "conv2_1_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 5
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_1_1"
  type: "ReLU"
  bottom: "conv2_1_1"
  top: "conv2_1_1"
}
layer {
  name: "norm2_1_1"
  type: "LRN"
  bottom: "conv2_1_1"
  top: "conv2_1_1"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  name: "pool2_1_1"
  type: "Pooling"
  bottom: "conv2_1_1"
  top: "pool2_1_1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "conv3_1_1"
  type: "Convolution"
  bottom: "pool2_1_1"
  top: "conv3_1_1"
  param {
    name: "conv3_1_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_1_1"
  type: "ReLU"
  bottom: "conv3_1_1"
  top: "conv3_1_1"
}
layer {
  name: "conv4_1_1"
  type: "Convolution"
  bottom: "conv3_1_1"
  top: "conv4_1_1"
  param {
    name: "conv4_1_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_1_1"
  type: "ReLU"
  bottom: "conv4_1_1"
  top: "conv4_1_1"
}
layer {
  name: "conv5_1_1"
  type: "Convolution"
  bottom: "conv4_1_1"
  top: "conv5_1_1"
  param {
    name: "conv5_1_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv5_1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu5_1_1"
  type: "ReLU"
  bottom: "conv5_1_1"
  top: "conv5_1_1"
}
layer {
  name: "pool5_1_1"
  type: "Pooling"
  bottom: "conv5_1_1"
  top: "pool5_1_1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "fc6_1_1"
  type: "InnerProduct"
  bottom: "pool5_1_1"
  top: "fc6_1_1"
  param {
    name: "fc6_1_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc6_1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu6_1_1"
  type: "ReLU"
  bottom: "fc6_1_1"
  top: "fc6_1_1"
}
layer {
  name: "drop6_1_1"
  type: "Dropout"
  bottom: "fc6_1_1"
  top: "fc6_1_1"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7_1_1"
  type: "InnerProduct"
  bottom: "fc6_1_1"
  top: "fc7_1_1"
  param {
    name: "fc7_1_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc7_1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu7_1_1"
  type: "ReLU"
  bottom: "fc7_1_1"
  top: "fc7_1_1"
}
layer {
  name: "drop7_1_1"
  type: "Dropout"
  bottom: "fc7_1_1"
  top: "fc7_1_1"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "data"
  type: "Python"
  top: "Python1"
  top: "Python2"
  include {
    phase: TRAIN
  }
  python_param {
    module: "layers.multilabel_data"
    layer: "MultiLabelData"
    param_str: "class_list: [0, 1, 2, 3]\nnum_classes: 4\nstage: TRAIN\n"
  }
}
layer {
  name: "Convolution1"
  type: "Convolution"
  bottom: "Python1"
  top: "Convolution1"
  param {
    name: "conv1_1_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    bias_term: true
    pad: 0
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Pooling1"
  type: "Pooling"
  bottom: "Convolution1"
  top: "Pooling1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "Convolution2"
  type: "Convolution"
  bottom: "Pooling1"
  top: "Convolution2"
  param {
    name: "conv2_1_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 5
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Pooling2"
  type: "Pooling"
  bottom: "Convolution2"
  top: "Pooling2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "Convolution3"
  type: "Convolution"
  bottom: "Pooling2"
  top: "Convolution3"
  param {
    name: "conv3_1_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Convolution4"
  type: "Convolution"
  bottom: "Convolution3"
  top: "Convolution4"
  param {
    name: "conv4_1_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Convolution5"
  type: "Convolution"
  bottom: "Convolution4"
  top: "Convolution5"
  param {
    name: "conv5_1_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv5_1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "Pooling3"
  type: "Pooling"
  bottom: "Convolution5"
  top: "Pooling3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "InnerProduct1"
  type: "InnerProduct"
  bottom: "Pooling3"
  top: "InnerProduct1"
  param {
    name: "fc6_1_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc6_1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fc7_1_2"
  type: "InnerProduct"
  bottom: "InnerProduct1"
  top: "fc7_1_2"
  param {
    name: "fc7_1_2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc7_1_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu7_1_2"
  type: "ReLU"
  bottom: "fc7_1_2"
  top: "fc7_1_2"
}
layer {
  name: "drop7_1_2"
  type: "Dropout"
  bottom: "fc7_1_2"
  top: "fc7_1_2"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "score_fc1_1"
  type: "InnerProduct"
  bottom: "fc7_1_1"
  top: "score_fc1_1"
  param {
    name: "score_fc1_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "score_fc1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "score_fc1_2"
  type: "InnerProduct"
  bottom: "fc7_1_1"
  top: "score_fc1_2"
  param {
    name: "score_fc1_2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "score_fc1_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fc6_1_2"
  type: "InnerProduct"
  bottom: "pool5_1_1"
  top: "fc6_1_2"
  param {
    name: "fc6_1_2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc6_1_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fc7_2_1"
  type: "InnerProduct"
  bottom: "fc6_1_2"
  top: "fc7_2_1"
  param {
    name: "fc7_2_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc7_2_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "score_fc2_1"
  type: "InnerProduct"
  bottom: "fc7_2_1"
  top: "score_fc2_1"
  param {
    name: "score_fc2_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "score_fc2_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "score_fc2_2"
  type: "InnerProduct"
  bottom: "fc7_2_1"
  top: "score_fc2_2"
  param {
    name: "score_fc2_2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "score_fc2_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "score"
  type: "Concat"
  bottom: "score_fc1_1"
  bottom: "score_fc1_2"
  bottom: "score_fc2_1"
  bottom: "score_fc2_2"
  top: "score"
  concat_param {
    axis: 1
  }
}
layer {
  name: "prob"
  type: "Sigmoid"
  bottom: "score"
  top: "prob"
}
layer {
  name: "loss"
  type: "SigmoidCrossEntropyLoss"
  bottom: "score"
  bottom: "label"
  top: "loss"
  loss_weight: 1.0
  include {
    phase: TRAIN
  }
}
layer {
  name: "error"
  type: "Python"
  bottom: "prob"
  bottom: "label"
  top: "error"
  python_param {
    module: "layers.multilabel_err"
    layer: "MultiLabelErr"
  }
}
layer {
  name: "relu6_1_2"
  type: "ReLU"
  bottom: "fc6_1_2"
  top: "fc6_1_2"
}
layer {
  name: "drop6_1_2"
  type: "Dropout"
  bottom: "fc6_1_2"
  top: "fc6_1_2"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "relu7_2_1"
  type: "ReLU"
  bottom: "fc7_2_1"
  top: "fc7_2_1"
}
layer {
  name: "drop7_2_1"
  type: "Dropout"
  bottom: "fc7_2_1"
  top: "fc7_2_1"
  dropout_param {
    dropout_ratio: 0.5
  }
}
