layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "label"
  python_param {
    module: "layers.multilabel_data"
    layer: "MultiLabelData"
    param_str: "class_list: [4, 24]\nnum_classes: 2\nstage: VAL\n"
  }
}
layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "label"
  python_param {
    module: "layers.multilabel_data"
    layer: "MultiLabelData"
    param_str: "class_list: [4, 24]\nnum_classes: 2\nstage: TRAIN\n"
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    name: "conv1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.0416666666667
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "fc1-1"
  type: "InnerProduct"
  bottom: "conv1"
  top: "fc1-1"
  param {
    name: "fc1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fc1-2"
  type: "InnerProduct"
  bottom: "conv1"
  top: "fc1-2"
  param {
    name: "fc1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fc1"
  type: "Concat"
  bottom: "fc1-1"
  bottom: "fc1-2"
  top: "fc1"
  concat_param {
    axis: 1
  }
}
layer {
  name: "loss"
  type: "SigmoidCrossEntropyLoss"
  bottom: "data"
  bottom: "fc1"
  top: "loss"
  loss_weight: 1.0
  include {
    phase: TRAIN
  }
}
layer {
  name: "error"
  type: "Python"
  bottom: "data"
  bottom: "fc1"
  top: "error"
  python_param {
    module: "layers.multilabel_err"
    layer: "MultiLabelErr"
  }
}
